---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCImportOptions.Action
source: html/070af608-cb1e-43d5-f3ca-6d53150f9dbb.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions.Action Property

The action of the import.

## Syntax (C#)
```csharp
public IFCImportAction Action { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration